udpate readme for including mermaid flowchart
